# Отчёт по лабораторной работе №1

Выполнил: Григорьев Глеб Алексеевич, группа М8О-102БВ-25

## Цель работы

Реализовать бинарное дерево поиска с базовыми операциями, дополнительно реализовать метод нахождения листа с минимальной глубиной (вариант 4)

## Содержание

- `tree.c` — реализация структуры дерева и операций
- `tree.h` — заголовочный файл для импорта и тестирований
- `test.c` — тесты
- `test.h` — заголовочный файл для тестов
- `main.c` — основная программа с текстовым меню
- `Makefile` — сборочный файл

## Как собрать и запустить

### Основная программа

В каталоге с проектом выполнить:

```bash
make all
./main
```

## Что происходит при выполнении команды:
1. Компиляция tree.c в объектный файл tree.o
2. Компиляция test.c в объектный файл test.o
3. Линковка объектных файлов в исполняемый файл test
4. Автоматический запуск тестовой программы

## Основные аспекты программы

### 1. Добавление узла (Insert)

**Функция:** `Node* insert(Node* root, int value)`

**Назначение:** Вставка нового значения в бинарное дерево поиска.

| Шаг | Действие | Условие |
|-----|----------|---------|
| 1 | Проверка пустоты | Если `root == NULL` |
| 2 | Сравнение | Если `value < root->data` → влево |
| 3 | Вставка | Рекурсивный вызов |

### 2. Удаление узла (Delete)

**Функция:** `Node* deleteNode(Node* root, int value)`

**Назначение:** Удаление узла по значению с сохранением структуры бинарного дерева поиска.

**Входные данные:**
- `root` — указатель на корень дерева
- `value` — значение узла для удаления

**Выходные данные:** Указатель на (возможно обновлённый) корень дерева

---

#### Алгоритм работы

| Шаг | Действие | Условие |
|-----|----------|---------|
| 1 | Поиск узла | Рекурсивный спуск по дереву |
| 2 | Определение случая | Проверка количества потомков |
| 3 | Выполнение удаления | Согласно одному из трёх случаев |
| 4 | Возврат результата | Обновлённый указатель на корень |

### 3. Поиск минимального элемента (FindMin)

**Функция:** `Node* findMin(Node* root)`

**Назначение:** Поиск узла с наименьшим значением в бинарном дереве поиска.

**Входные данные:**
- `root` — указатель на корень дерева (или поддерева)

**Выходные данные:** Указатель на узел с минимальным значением (или `NULL` если дерево пустое)

---

#### Алгоритм работы

| Шаг | Действие | Условие |
|-----|----------|---------|
| 1 | Начать с корня | `current = root` |
| 2 | Проверить левого потомка | Если `current->left != NULL` |
| 3 | Перейти влево | `current = current->left` |
| 4 | Повторять | Пока есть левый потомок |
| 5 | Вернуть результат | Текущий узел — минимум |

### 4. Визуализация дерева (PrintTree)

**Функция:** `void printTree(Node* root, int level)`

**Назначение:** Вывод структуры бинарного дерева в консоль с отступами, пропорциональными глубине узлов.

**Входные данные:**
- `root` — указатель на корень дерева (или поддерева)
- `level` — текущая глубина узла (начинать с 0)

**Выходные данные:** Нет (печать в консоль через `printf`)

---

#### Алгоритм работы

| Шаг | Действие | Условие |
|-----|----------|---------|
| 1 | Проверка пустоты | Если `root == NULL` → вернуться |
| 2 | Обход правого поддерева | Рекурсивный вызов `printTree(root->right, level + 1)` |
| 3 | Печать отступов | `4 пробела × level` |
| 4 | Печать значения | `printf("%d\n", root->data)` |
| 5 | Обход левого поддерева | Рекурсивный вызов `printTree(root->left, level + 1)` |$


## Описание тестов
### В файле test.c реализовано 5 тестов:

| Функция | Что проверяет | Критерий успеха |
|---------|---------------|-----------------|
| `testInsert()` | Вставка узлов в дерево | Корень создан и содержит значение 10 |
| `testFindMin()` | Поиск минимального элемента | Найден узел со значением 20 |
| `testDelete()` | Удаление листа (узла без потомков) | Левый потомок корня стал NULL |
| `testTreeStructure()` | Порядок элементов в дереве | Левый < Корень < Правый |
| `testDeleteRoot()` | Удаление корня с двумя потомками | Новый корень содержит значение 12 (наследник) |

### Запуск тестов
```bash
make test
```